# Вариант 27
# Дана строка, состоящая из русских слов, разделённых пробелами (одним или
# несколькими). Найти количество слов в строке.

print("Количество слов в сроке: ", input("Введите текст: ").count(' ') + 1)